Config/Reports/КонтрольИсполненияДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>КонтрольИсполненияДоговоров</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьЗаголовок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПодвал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВывестиГрафикПлатежей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВывестиПланГрафикИсполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоДатамИсполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Config/Reports/КонтрольИсполненияДоговоров/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РежимРасшифровки = (Параметры.Свойство("Расшифровка") И Параметры.Расшифровка <> Неопределено);
	Если РежимРасшифровки Тогда // Формирование отчета в режиме расшифровки с детализацией по регистраторам.
		
		ЗаполнитьЗначенияСвойств(Отчет, Параметры,
			"Организация,Контрагент,Договор,ВывестиГрафикПлатежей,ВывестиПланГрафикИсполнения,Периодичность,ВыводитьЗаголовок,ВыводитьПодвал");
		
		ВестиГрафикПлатежей = Отчет.ВывестиГрафикПлатежей;
		ВестиПланГрафикИсполнения = Отчет.ВывестиПланГрафикИсполнения;
		
		// В режиме расшифровки отчет формируется по документам движения.
		Элементы.Периодичность.СписокВыбора.Очистить();
		Элементы.Периодичность.СписокВыбора.Добавить(2, "По документам движения");
		Элементы.Периодичность.ТолькоПросмотр = Истина;
		Отчет.Периодичность = 2; // Регистратор.
		
		Если Параметры.Расшифровка.Свойство("Период") Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ) КАК НачалоПериода,
			               |	КОНЕЦПЕРИОДА(&Период, МЕСЯЦ) КАК ЕонецПериода";
			Запрос.УстановитьПараметр("Период", Параметры.Расшифровка.Период);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "МЕСЯЦ",
				Отчеты.КонтрольИсполненияДоговоров.ТипПериода(Параметры.Периодичность));
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Отчет.НачалоПериода = Выборка.НачалоПериода;
				Отчет.КонецПериода  = Выборка.ЕонецПериода;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли Параметры.Свойство("Отбор") Тогда // Обычный режим формирования отчета.
		
		Если Параметры.Отбор.Свойство("Договор") Тогда
			
			РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.Отбор.Договор,
				"Контрагент,Организация,Ссылка");
			Отчет.Организация = РеквизитыДоговора.Организация;
			Отчет.Контрагент  = РеквизитыДоговора.Контрагент;
			Отчет.Договор     = РеквизитыДоговора.Ссылка;
			
		Иначе
			ЗаполнитьЗначенияСвойств(Отчет, Параметры.Отбор);
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Отчет.Организация) Тогда
		Отчет.Организация = ОбщегоНазначенияБГУ.ТекущаяОрганизация();
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Отчет.Периодичность) Тогда
		Отчет.Периодичность = 9; // По месяцам.
	КонецЕсли;
	
	УправлениеФормойНаСервере();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"РегистрацияДоговорныхОбязательств", "Видимость", Элементы.ПоказатьДокументыКорректировки.Пометка);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойПользовательскихНастроекНаСервере(Настройки)
	
	Если РежимРасшифровки Тогда // В режиме расшифровки устанавливаем быстрые отборы из данных расшифровки.
	
		Если Параметры.Расшифровка.Свойство("ИФО") И ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") Тогда
			Параметр = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ИФО");
			ПользовательскаяНастройка = Настройки.Элементы.Найти(Параметр.ИдентификаторПользовательскойНастройки);
			ПользовательскаяНастройка.Значение = Параметры.Расшифровка.ИФО;
			ПользовательскаяНастройка.Использование = Истина;
		КонецЕсли;
		Если Параметры.Расшифровка.Свойство("КФО") Тогда
			Параметр = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КФО");
			ПользовательскаяНастройка = Настройки.Элементы.Найти(Параметр.ИдентификаторПользовательскойНастройки);
			ПользовательскаяНастройка.Значение = Параметры.Расшифровка.КФО;
			ПользовательскаяНастройка.Использование = Истина;
		КонецЕсли;
		Если Параметры.Расшифровка.Свойство("КПС") Тогда
			Параметр = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КПС");
			ПользовательскаяНастройка = Настройки.Элементы.Найти(Параметр.ИдентификаторПользовательскойНастройки);
			ПользовательскаяНастройка.Значение = Параметры.Расшифровка.КПС;
			ПользовательскаяНастройка.Использование = Истина;
		КонецЕсли;
		Если Параметры.Расшифровка.Свойство("КЭК") Тогда
			Параметр = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КЭК");
			ПользовательскаяНастройка = Настройки.Элементы.Найти(Параметр.ИдентификаторПользовательскойНастройки);
			ПользовательскаяНастройка.Значение = Параметры.Расшифровка.КЭК;
			ПользовательскаяНастройка.Использование = Истина;
		КонецЕсли;
		Если Параметры.Расшифровка.Свойство("СчетРасчетов") Тогда
			Параметр = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СчетРасчетов");
			ПользовательскаяНастройка = Настройки.Элементы.Найти(Параметр.ИдентификаторПользовательскойНастройки);
			ПользовательскаяНастройка.Значение = Параметры.Расшифровка.СчетРасчетов;
			ПользовательскаяНастройка.Использование = Истина;
		КонецЕсли;
		Если Параметры.Расшифровка.Свойство("ВидРасчетов") Тогда
			Параметр = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ВидРасчетов");
			ПользовательскаяНастройка = Настройки.Элементы.Найти(Параметр.ИдентификаторПользовательскойНастройки);
			ПользовательскаяНастройка.Значение = Параметры.Расшифровка.ВидРасчетов;
			ПользовательскаяНастройка.Использование = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойВариантаНаСервере(Настройки)
	
	Если РежимРасшифровки Тогда // В режиме расшифровки устанавливаем детализацию по регистратору.
	
		Для Каждого ВложеннаяСКД Из Настройки.Структура Цикл
			
			Если НЕ ТипЗнч(ВложеннаяСКД) = Тип("НастройкиВложенногоОбъектаКомпоновкиДанных") Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого ТаблицаОтчета Из ВложеннаяСКД.Настройки.Структура Цикл
				
				Если НЕ ТипЗнч(ТаблицаОтчета) = Тип("ТаблицаКомпоновкиДанных") Тогда
					Продолжить;
				КонецЕсли;
				
				Для Каждого СтрокаТаблицы Из ТаблицаОтчета.Строки Цикл
					УстановитьДетализациюПоРегистратору(СтрокаТаблицы);
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатПриАктивизацииОбласти(Элемент)
	
	СтандартныеОтчетыКлиент.РезультатПриАктивизацииОбласти(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	ЗначенияРасшифровки = ЗначенияРасшифровкиЯчейки(Расшифровка, ДанныеРасшифровки);
	
	Если РежимРасшифровки ИЛИ Отчет.ПоДатамИсполнения Тогда
		
		Если ЗначениеЗаполнено(ЗначенияРасшифровки.ТекущийРесурс) Тогда
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
		
	Иначе
		
		Если ЗначениеЗаполнено(ЗначенияРасшифровки.ТекущийРесурс) Тогда
			
			СтандартнаяОбработка = Ложь;
			
			ПараметрыФормы = Новый Структура("Организация,Контрагент,Договор,Периодичность,ВыводитьЗаголовок,ВыводитьПодвал");
			ЗаполнитьЗначенияСвойств(ПараметрыФормы, Отчет);
			
			Если НЕ ЗначениеЗаполнено(ПараметрыФормы.Контрагент)
				И ЗначениеЗаполнено(ЗначенияРасшифровки.Контрагент) Тогда
				ПараметрыФормы.Контрагент = ЗначенияРасшифровки.Контрагент;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(ПараметрыФормы.Договор)
				И ЗначениеЗаполнено(ЗначенияРасшифровки.Договор) Тогда
				ПараметрыФормы.Договор = ЗначенияРасшифровки.Договор;
			КонецЕсли;
			
			ПараметрыФормы.Вставить("Расшифровка", ЗначенияРасшифровки.Параметры);
			
			Если СтрНайти(ЗначенияРасшифровки.ТекущийРесурс, "Оплат")
				ИЛИ СтрНайти(ЗначенияРасшифровки.ТекущийРесурс, "Оплач") Тогда
				ПараметрыФормы.Вставить("ВывестиГрафикПлатежей", Истина);
				ПараметрыФормы.Вставить("ВывестиПланГрафикИсполнения", Ложь);
			ИначеЕсли СтрНайти(ЗначенияРасшифровки.ТекущийРесурс, "Исполнен") Тогда
				ПараметрыФормы.Вставить("ВывестиГрафикПлатежей", Ложь);
				ПараметрыФормы.Вставить("ВывестиПланГрафикИсполнения", Истина);
			Иначе
				ПараметрыФормы.Вставить("ВывестиГрафикПлатежей", Истина);
				ПараметрыФормы.Вставить("ВывестиПланГрафикИсполнения", Истина);
			КонецЕсли;
			
			КонтрольИсполненияДоговоровКлиент.ОткрытьГрафикИсполненияДоговора(
				ЗначенияРасшифровки.Договор, ПараметрыФормы, , ЭтотОбъект, ЭтотОбъект);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	УправлениеФормойНаСервере();
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	УправлениеФормойНаСервере();
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	УправлениеФормойНаСервере();
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоДатамИсполненияПриИзменении(Элемент)
	
	Если Отчет.ПоДатамИсполнения Тогда
		Отчет.Периодичность = 0;
	Иначе
		Отчет.Периодичность = 9; // По умолчанию - по месяцам.
	КонецЕсли;
	
	УстановитьДоступностьРеквизитаПериодичность(ЭтотОбъект);
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиГрафикПлатежейПриИзменении(Элемент)
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиПланГрафикИсполненияПриИзменении(Элемент)
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьПериод(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период.ДатаНачала = Отчет.НачалоПериода;
	Диалог.Период.ДатаОкончания = Отчет.КонецПериода;
	Диалог.Показать(Новый ОписаниеОповещения("УстановитьПериодЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериодЗавершение(Период, ДополнительныеПараметры) Экспорт
	
	Если Период <> Неопределено Тогда
		
		Отчет.НачалоПериода = Период.ДатаНачала;
		Отчет.КонецПериода  = Период.ДатаОкончания;
		
		Модифицированность = Истина;
		
		СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПоПочте(Команда)
	
	ОтображениеСостояния = Элементы.Результат.ОтображениеСостояния;
	Если ОтображениеСостояния.Видимость = Истина
		И ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность Тогда
		ТекстВопроса = НСтр("ru = 'Отчет не сформирован. Сформировать?'");
		Обработчик = Новый ОписаниеОповещения("СформироватьПередОтправкойПоПочте", ЭтотОбъект);
		ПоказатьВопрос(Обработчик, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да);
	Иначе
		ПоказатьДиалогОтправкиПоПочте();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДокументыКорректировки(Команда)
	
	Элементы.ПоказатьДокументыКорректировки.Пометка = НЕ Элементы.ПоказатьДокументыКорректировки.Пометка;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"РегистрацияДоговорныхОбязательств", "Видимость", Элементы.ПоказатьДокументыКорректировки.Пометка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФормойНаСервере()
	
	Если НЕ РежимРасшифровки Тогда // При расшифровке значения флагов Вывести* передаются из основного отчета.
		
		Если ЗначениеЗаполнено(Отчет.Договор) Тогда
			
			РеквизитыДоговора = РеквизитыДоговора(Отчет.Договор);
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыДоговора, "ВестиГрафикПлатежей,ВестиПланГрафикИсполнения");
			
		Иначе
			
			ВестиГрафикПлатежей = Истина;
			ВестиПланГрафикИсполнения = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Отчет.ВывестиГрафикПлатежей = ВестиГрафикПлатежей;
	Отчет.ВывестиПланГрафикИсполнения = ВестиПланГрафикИсполнения;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВывестиГрафикПлатежей",
		"Доступность", ВестиГрафикПлатежей);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВывестиПланГрафикИсполнения",
		"Доступность", ВестиПланГрафикИсполнения);
	
	// Синхронизируем отборы в журнале документов корректировки графиков с реквизитами шапки отчета.
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(РегистрацияДоговорныхОбязательств,
		"Организация", Отчет.Организация, ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(Отчет.Организация), 
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(РегистрацияДоговорныхОбязательств,
		"Контрагент", Отчет.Контрагент, ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(Отчет.Контрагент), 
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(РегистрацияДоговорныхОбязательств,
		"Договор", Отчет.Договор, ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(Отчет.Договор), 
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
	УстановитьДоступностьРеквизитаПериодичность(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьРеквизитаПериодичность(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "Периодичность",
		"Доступность", Не Форма.Отчет.ПоДатамИсполнения);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РеквизитыДоговора(Договор)
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор,
		"Ссылка,ВестиГрафикПлатежей,ВестиПланГрафикИсполнения");
	
КонецФункции

&НаКлиенте
Процедура ПоказатьДиалогОтправкиПоПочте()
	
	НаименованиеОтчета = НСтр("ru = 'График исполнения договоров'");
	
	Вложение = Новый Структура;
	Вложение.Вставить("АдресВоВременномХранилище", ПоместитьВоВременноеХранилище(Результат, УникальныйИдентификатор));
	Вложение.Вставить("Представление", НаименованиеОтчета);
	
	СписокВложений = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Вложение);
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСПочтовымиСообщениями") Тогда
		МодульРаботаСПочтовымиСообщениямиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСПочтовымиСообщениямиКлиент");
		ПараметрыОтправки = МодульРаботаСПочтовымиСообщениямиКлиент.ПараметрыОтправкиПисьма();
		ПараметрыОтправки.Тема = НаименованиеОтчета;
		ПараметрыОтправки.Вложения = СписокВложений;
		МодульРаботаСПочтовымиСообщениямиКлиент.СоздатьНовоеПисьмо(ПараметрыОтправки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначенияРасшифровкиЯчейки(Расшифровка, ДанныеРасшифровки)
	
	ЗначенияРасшифровки = Новый Структура("Контрагент,Договор, Параметры, ТекущийРесурс");
	ЗначенияРасшифровки.Параметры = Новый Структура;
	
	ДанныеРасшифровкиОбъект = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	МассивПолей = СтандартныеОтчеты.ПолучитьМассивПолейРасшифровки(Расшифровка, ДанныеРасшифровкиОбъект, , Истина);
	
	Для Каждого ПолеРасшифровки Из МассивПолей Цикл
		
		Если ПолеРасшифровки.Поле = "Контрагент" Тогда
			ЗначенияРасшифровки.Контрагент = ПолеРасшифровки.Значение;
		ИначеЕсли ПолеРасшифровки.Поле = "Договор" Тогда
			ЗначенияРасшифровки.Договор = ПолеРасшифровки.Значение;
		ИначеЕсли СтрНайти("ИФО,КФО,КПС,КЭК,СчетРасчетов,ВидРасчетов,Период", ПолеРасшифровки.Поле) > 0 Тогда
			ЗначенияРасшифровки.Параметры.Вставить(ПолеРасшифровки.Поле, ПолеРасшифровки.Значение);
		ИначеЕсли СтрНайти("НеОплаченоНаНачало,ОплатаПлан,ОплатаФакт,НеОплаченоНаКонец,
			|НеИсполненоНаНачало,ИсполнениеПлан,ИсполнениеФакт,НеИсполненоНаКонец", ПолеРасшифровки.Поле) > 0 Тогда
			ЗначенияРасшифровки.ТекущийРесурс = ПолеРасшифровки.Поле;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЗначенияРасшифровки;
	
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьДетализациюПоРегистратору(СтрокаТаблицы)
	
	Для Каждого ЭлементСтруктуры Из СтрокаТаблицы.Структура Цикл
		
		Для Каждого ПодчиненныйЭлемент Из ЭлементСтруктуры.Структура Цикл
			// Рекурсивный вызов для вложенных элементов структуры.
			УстановитьДетализациюПоРегистратору(ПодчиненныйЭлемент);
		КонецЦикла;
		
		Если ЭлементСтруктуры.ПоляГруппировки.Элементы.Количество() = 1
			И ЭлементСтруктуры.ПоляГруппировки.Элементы[0].Поле = Новый ПолеКомпоновкиДанных("Период") Тогда
			// Группировку Период заменим на группировку по документам движения (регистраторам).
			ЭлементСтруктуры.ПоляГруппировки.Элементы[0].Поле = Новый ПолеКомпоновкиДанных("Регистратор");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
